// flag.cpp : implementation file
//
/*
***************************************************
模块名       ：Cflag
文件名       ：Cflag
相关文件     ：无
文件实现功能 ：设定全局变量
作者         ：喻超蓉
版本         ：1.0
-----------------------------------------------------------------------------
备注         ：无
-----------------------------------------------------------------------------
修改记录     ：
日期       版本       修改人        修改内容
2013/6/30  1.0        喻超蓉        无
***************************************************
*/
#include "stdafx.h"
#include "图书管理系统.h"
#include "flag.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

/////////////////////////////////////////////////////////////////////////////
// Cflag
CString flag;
int person;
/*
***************************************************
<PRE>
函数名 ：Cflag::Cflag
功能   ：设定全局变量
参数   ：
     [IN|OUT] 参数1: 无
     [IN|OUT] 参数2：无
返回值 ：无
抛出异常：
        类型1：无
        类型2：无
-----------------------------------------------------------------------------
备注   ：无
典型用法：无
-----------------------------------------------------------------------------
作者   ：喻超蓉
<PRE>
***************************************************
*/
Cflag::Cflag()
{
}

Cflag::~Cflag()
{
}


BEGIN_MESSAGE_MAP(Cflag, CEdit)
	//{{AFX_MSG_MAP(Cflag)
		// NOTE - the ClassWizard will add and remove mapping macros here.
	//}}AFX_MSG_MAP
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// Cflag message handlers
